app/views/apikeys/show.html.erb

SELECT "users".* FROM "users"
---
  <div class ="col-md-6 col-md-offset-5">
    <% User.all.each do |user| %>