app/controllers/apikeys_controller.rb

  def remove
    current_user.update_attribute(:api_key, nil)
---
UPDATE "users" SET "api_key" = ?, "updated_at" = ? WHERE "users"."id" = 6  [["api_key", nil], ["updated_at", "2015-02-10 12:57:59.805899"]]

  def add
    current_user.update_attribute(:api_key, SecureRandom.hex)
---
UPDATE "users" SET "api_key" = ?, "updated_at" = ? WHERE "users"."id" = 7  [["api_key", "10de152ea85bcc7bcbf0cd9d0d0500c4"], ["updated_at", "2015-02-10 13:20:15.837474"]]