app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.api_key = SecureRandom.hex

    if @user.save
---
INSERT INTO "users" ("api_key", "created_at", "email", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def admin_login
    u = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = '' LIMIT 1

  def login
    u = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'test@gmail.se' LIMIT 1